#pragma once
class checkpole {
public:
	void win() {
		// провер€ет координаты двух команд и если есть координаты которые соответствуют координатам победы. ¬ыводит надпись команда n победила.

	}
	void lose() {
		// ≈сли сработала void win тогда выводит надпись на экран: противоположна€ команда проиграла.
	}
	void draw() {
		//≈сли void win не сработал , а на поле не осталось место то команда выводит: Ќичь€
	}
	void inputinthefield() {
		//этот войд провер€ет есть ли в клетке x или o то он ввыводит ошибку в которой сказано что в этой клетке есть x или o. 
	}

};